<a href="https://colab.research.google.com/github/CMSSKKK/python/blob/main/kaggle_titanic.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# 머신러닝 맛보기

In [ ]:
import pandas as pd

train=pd.read_csv('/content/train.csv')
test=pd.read_csv('/content/test.csv')

In [ ]:
train.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [ ]:
x_train = train[['Pclass','SibSp','Parch','Fare']]
y_train = train[['Survived']]

In [ ]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

## 모델 선택 및 학습

In [ ]:
from sklearn.neighbors import KNeighborsClassifier
# 모델 선택
model = KNeighborsClassifier(n_neighbors=5)
model

KNeighborsClassifier(algorithm='auto', leaf_size=30, metric='minkowski',
                     metric_params=None, n_jobs=None, n_neighbors=5, p=2,
                     weights='uniform')

In [ ]:
# 모델 학습
model.fit(x_train, y_train['Survived'])

KNeighborsClassifier(algorithm='auto', leaf_size=30, metric='minkowski',
                     metric_params=None, n_jobs=None, n_neighbors=5, p=2,
                     weights='uniform')

## 모델 이용

In [ ]:
y_pred = model.predict(x_train)

In [ ]:
pd.DataFrame({
    'y_real' : y_train['Survived'],
    'y_pred' : y_pred
})

     y_real  y_pred
0         0       0
1         1       1
2         1       0
3         1       1
4         0       0
..      ...     ...
886       0       0
887       1       1
888       0       0
889       1       1
890       0       0

[891 rows x 2 columns]

In [ ]:
sum(model.predict(x_train) == y_train['Survived']) / len(y_train)

0.7665544332210998

### 결과제출

In [ ]:
test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Pclass       418 non-null    int64
 2   Name         418 non-null    object
 3   Sex          418 non-null    object
 4   Age          332 non-null    float64
 5   SibSp        418 non-null    int64
 6   Parch        418 non-null    int64
 7   Ticket       418 non-null    object
 8   Fare         417 non-null    float64
 9   Cabin        91 non-null     object
 10  Embarked     418 non-null    object
dtypes: float64(2), int64(4), object(5)
memory usage: 36.0+ KB

In [ ]:
x_test = test[['Pclass','SibSp','Parch','Fare']]
x_test = x_test.fillna(0)

In [ ]:
submit = pd.DataFrame({
    'PassengerId' :test['PassengerId'],
    'Survived' : model.predict(x_test)
})
submit.head()

   PassengerId  Survived
0          892         0
1          893         0
2          894         1
3          895         0
4          896         1

In [ ]:
submit.to_csv("submission.csv", index=False)

# 데이터 전처리

In [117]:
import pandas as pd
train = pd.read_csv("./train.csv")
test = pd.read_csv("./test.csv")
train.info()
test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Pclass       418 non-null    int64
 2   Name         418 non-null    object
 3   Sex          418 non-null    object
 4   Age          332 non-null    float64
 5   SibSp        418 non-null    int64
 6   Parch        418 non-null    int64
 7   Ticket       418 non-null    object
 8   Fare         417 non-null    float64
 9   Cabin        91 non-null     object
 10  Embarked     418 non-null    object
dtypes: float64(2), int64(4), object(5)
memory usage: 36.0+ KB

In [ ]:
train.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [ ]:
train['Age'] = train['Age'].fillna(train['Age'].mean())
test['Age'] = test['Age'].fillna(test['Age'].mean())

In [ ]:
test['Fare'] = test['Fare'].fillna(test['Fare'].median())

In [ ]:
train['Embarked'] = train['Embarked'].fillna('S')

In [ ]:
train = train.drop(['Cabin'], axis=1)
test = test.drop(['Cabin'], axis=1)

In [ ]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          891 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Embarked     891 non-null    object
dtypes: float64(2), int64(5), object(4)
memory usage: 76.7+ KB

In [ ]:
test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 10 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Pclass       418 non-null    int64
 2   Name         418 non-null    object
 3   Sex          418 non-null    object
 4   Age          418 non-null    float64
 5   SibSp        418 non-null    int64
 6   Parch        418 non-null    int64
 7   Ticket       418 non-null    object
 8   Fare         418 non-null    float64
 9   Embarked     418 non-null    object
dtypes: float64(2), int64(4), object(4)
memory usage: 32.8+ KB

###통계에서 제시하는 이상치 기준 
- 3 표준편차를 벗어난 경우
- 1.5 IQR을 벗어난 경우

In [ ]:
max_std = train['Fare'].mean() + 3 * train['Fare'].std()
max_std

181.2844937601214

In [119]:
IQR = train['Fare'].quantile(.75) - train['Fare'].quantile(.25)
max_quart = train['Fare'].quantile(.75) + 1.5 * IQR
max_quart

65.6344

In [121]:
train.loc[(train['Fare'] > max_std), 'Fare'] = max_std

## 원핫인코딩
- 각 범주를 칼럼으로 바꾼다.
- 범주에 맞게 해당하는 칼럼을 0또는 1로 넣는다.

In [122]:
import pandas as pd
path = 'https://raw.githubusercontent.com/blackdew/ml-tensorflow/master/data/csv/iris.csv'
df = pd.read_csv(path)
df.head()

   꽃잎길이  꽃잎폭  꽃받침길이  꽃받침폭      품종
0   5.1  3.5    1.4   0.2  setosa
1   4.9  3.0    1.4   0.2  setosa
2   4.7  3.2    1.3   0.2  setosa
3   4.6  3.1    1.5   0.2  setosa
4   5.0  3.6    1.4   0.2  setosa

In [ ]:
onehot = pd.get_dummies(df)
onehot.head()

   꽃잎길이  꽃잎폭  꽃받침길이  꽃받침폭  품종_setosa  품종_versicolor  품종_virginica
0   5.1  3.5    1.4   0.2          1              0             0
1   4.9  3.0    1.4   0.2          1              0             0
2   4.7  3.2    1.3   0.2          1              0             0
3   4.6  3.1    1.5   0.2          1              0             0
4   5.0  3.6    1.4   0.2          1              0             0

In [123]:
train_onehot = train.loc[:, ['Survived', 'Pclass', 'Sex', 'Age', 'SibSp',
                             'Parch', 'Fare', 'Embarked']]

In [124]:
train_onehot['Pclass'] = train_onehot['Pclass'].astype('category')
train_onehot['Sex'] = train_onehot['Sex'].astype('category')
train_onehot['Embarked'] = train_onehot['Embarked'].astype('category')

In [125]:
train_onehot = pd.get_dummies(train_onehot)
train_onehot.head()

   Survived   Age  SibSp  Parch  ...  Sex_male  Embarked_C  Embarked_Q  Embarked_S
0         0  22.0      1      0  ...         1           0           0           1
1         1  38.0      1      0  ...         0           1           0           0
2         1  26.0      0      0  ...         0           0           0           1
3         1  35.0      1      0  ...         0           0           0           1
4         0  35.0      0      0  ...         1           0           0           1

[5 rows x 13 columns]

In [129]:
# 불필요한 칼럼 제거
test_onehot = test.loc[:, ['Pclass', 'Sex', 'Age', 'SibSp', 'Parch', 'Fare', 'Embarked']]

# 타입 변경
test_onehot['Pclass'] = test_onehot['Pclass'].astype('category')
test_onehot['Sex'] = test_onehot['Sex'].astype('category')
test_onehot['Embarked'] = test_onehot['Embarked'].astype('category')

# 원핫인코딩
test_onehot = pd.get_dummies(test_onehot)
test_onehot.head(3)

    Age  SibSp  Parch    Fare  ...  Sex_male  Embarked_C  Embarked_Q  Embarked_S
0  34.5      0      0  7.8292  ...         1           0           1           0
1  47.0      1      0  7.0000  ...         0           0           0           1
2  62.0      0      0  9.6875  ...         1           0           1           0

[3 rows x 12 columns]

### 정규화

In [133]:
# minmax normalize
train_min, train_max = train_onehot.min(axis=0), train_onehot.max(axis=0)
train_normal = (train_onehot - train_min) / (train_max - train_min)
train_normal.head()

   Survived       Age  SibSp  ...  Embarked_C  Embarked_Q  Embarked_S
0       0.0  0.271174  0.125  ...         0.0         0.0         1.0
1       1.0  0.472229  0.125  ...         1.0         0.0         0.0
2       1.0  0.321438  0.000  ...         0.0         0.0         1.0
3       1.0  0.434531  0.125  ...         0.0         0.0         1.0
4       0.0  0.434531  0.000  ...         0.0         0.0         1.0

[5 rows x 13 columns]

In [131]:
# minmax normalize
test_min, test_max = train_min.drop(['Survived']), train_max.drop(['Survived'])
test_normal = (test_onehot - test_min) / (test_max - test_min)
test_normal.head()

        Age  SibSp     Parch  ...  Embarked_C  Embarked_Q  Embarked_S
0  0.428248  0.000  0.000000  ...         0.0         1.0         0.0
1  0.585323  0.125  0.000000  ...         0.0         0.0         1.0
2  0.773813  0.000  0.000000  ...         0.0         1.0         0.0
3  0.334004  0.000  0.000000  ...         0.0         0.0         1.0
4  0.271174  0.125  0.166667  ...         0.0         0.0         1.0

[5 rows x 12 columns]

In [135]:
# 표준정규화 // 수치형만 따로 떼내서 처리해야함
train_forSt = train_onehot[['Age', 'SibSp','Parch','Fare']]
train_mean, train_std = train_forSt.mean(axis=0), train_forSt.std(axis=0)
train_standard = (train_forSt - train_mean) / train_std
train_standard.head()

        Age     SibSp     Parch      Fare
0 -0.530005  0.432550 -0.473408 -0.615143
1  0.571430  0.432550 -0.473408  1.115974
2 -0.254646 -0.474279 -0.473408 -0.596895
3  0.364911  0.432550 -0.473408  0.624395
4  0.364911 -0.474279 -0.473408 -0.593515